# SegmentsFittings Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroupTypeId..::..SegmentsFittings Property
GroupTypeId Class See Also
---
Segments and Fittings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public static ForgeTypeId SegmentsFittings { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SegmentsFittings As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SegmentsFittings {
	ForgeTypeId^ get ();
}
```

# See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace